k = (1, {"название": "компьютер", "цена": 20000, "количество": 5, "eд": "шт."})
p = (2, {"название": "принтер", "цена": 6000, "количество": 2, "eд": "шт."})
s = (3, {"название": "сканер", "цена": 2000, "количество": 7, "eд": "шт."})

dic1 = k[1]
dic2 = p[1]
dic3 = s[1]

product = [dic1["название"], dic2["название"], dic3["название"]]
prise = [dic1["цена"], dic2["цена"], dic3["цена"]]
quan = [dic1["количество"], dic2["количество"], dic3["количество"]]

dic = {"название": product, "цена": prise, "количество": quan, "ед":"шт"}

print(dic)
